In [1]:
import pandas as pd

In [4]:
data = {"name":["a","b","c","d","a","c"], "eng":[6,5,6,6,6,3,],"urdu":[2,3,4,2,2,7,]}
df = pd.DataFrame(data)
df

  name  eng  urdu
0    a    6     2
1    b    5     3
2    c    6     4
3    d    6     2
4    a    6     2
5    c    3     7

In [5]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [8]:
df["duplicated"] = df.duplicated()

In [9]:
df

  name  eng  urdu  duplicated
0    a    6     2       False
1    b    5     3       False
2    c    6     4       False
3    d    6     2       False
4    a    6     2        True
5    c    3     7       False

In [10]:
df.drop_duplicates(inplace=True)

In [11]:
df

  name  eng  urdu  duplicated
0    a    6     2       False
1    b    5     3       False
2    c    6     4       False
3    d    6     2       False
4    a    6     2        True
5    c    3     7       False

In [12]:
dataset = pd.read_excel("Book1.xlsx")
dataset.head(7)

,Description,Invoice,Col,Item,Qty,Unit Price,Discount,Total
0,Invoice 3-456-1 Data 1,3-456-1,444.000000,NaN,1,1,12.0,-11.0
1,Invoice 3-456-1 Data 2,3-456-1,342.000000,323.0,2,2,23.0,-19.0
2,Invoice 3-456-1 Data 3,3-456-1,345.000000,23.0,3,3,3.0,6.0
3,Invoice 3-456-1 Data 4,3-456-1,456.000000,NaN,4,4,4.0,12.0
4,Invoice 3-456-1 Data 5,3-456-1,556.000000,454.0,5,5,5.0,20.0
5,Invoice 3-456-1 Data 6,3-456-1,556.000000,554.0,6,6,6.0,30.0
6,Invoice 3-456-1 Data 7,3-456-1,658.466667,566.0,7,7,7.0,42.0

In [13]:
dataset.shape

(117, 8)

In [14]:
dataset.drop_duplicates(inplace=True)

In [15]:
dataset.shape

(117, 8)